########### 函数分三类：内置函数、模块提供的函数、自定义函数

# 1、内置函数：python中有70多个，不需要导包的函数：int()、pring() list()
# python自带的，不需要导入任何模块，直接就能用的函数。
# 它们是python解释器的一部分，随python启动就加载好了。

# 2、模块提供的函数：python标准库或第三方库，封装在模块 .py文件 里的函数，需要先导入模块才能使用
# > 导入：import 模块名
#       或 from 模块名 import 函数名导入
# > 功能细分：不同模块对应不同领域的功能（数学、文件、网络）
# > 可扩展性：除了标准库（python官方提供的），还能安装第三方库如：numpy、pandas,使用更多函数
#          导入第三方 安装后才能使用： pip install numpy

# 演示一个随机数 python自带的
import random as rnd  # 将模块指定一个名字，方便使用方便

print(rnd.randint(1, 2))  # 1或2


# 3、自定义函数：用def 关键字自己写的
# > 完全可控：逻辑、参数、返回值由自己
# > 可复用：一次定义，多次调用，避免重复代码


