######## 通过条件 快速生成一个集合的语法：

# 数组先遍历，数组取出每个值给到x,然后再将x塞进容器，因为容器值不能重复所以结果：1、2、3、5、6
set1 = {x for x in [1, 2, 3, 3, 3, 5, 6]}
print(set1)

# 增加条件 结果：1、2、5、6
set2 = {x for x in [1, 2, 3, 3, 3, 5, 6] if x != 3}
print(set2)

# 增加条件 1-9取数 条件：x!=3 ,结果：1、2、4、5、6、7、8、9
set3 = {x for x in range(1, 10) if x != 3}
print(set3)

# 增加条件 1-9取数，条件：x%2==0,结果：2、4、6、8
set3 = {x for x in range(1, 10) if x % 2 == 0}  # 取余==0，说明时偶数
print(set3)

# 字符串str、列表list、元组tuple、字典dict、集合set
# 单引号双引号三引号、[]、 ()、 {key,value}、{value}
''' 
区别：
    1、tuple内的数据不可变，其他可变
    2、dict中的key不可重复，通过key操作
    3、set中的value不可以重复，但为乱序,通过函数操作
    4、str中的字符不可修改
    5、list有序，通过下标操作

以上几种容器，不同场景依据不同特征去选用。
切片：[:::] 开始、结果、步长 边界下标从0开始，包开始不包结束
range(:::) 开始、结束、步长 边界数，自然数的范围，包开始不包结束
集合的：交集& 并集｜ 差集- 对称差集^
函数：len长度、del删除
'''
