# 实参传给函数形参，是把堆中的内存地址传过去了
# 首先arg1接受到的是存放在堆中 11 对象的内存地址
# arg1 = 100 ,是把栈中arg1指向的内存地址改成 -> 存放在堆中的100对象的内存地址，所以此时arg1的内存地址发生了变化
# 列表其实是一样：把n2指向堆中的列表内存传给了 arg2 ,arg2追加10，是将堆中内存追加了，所以arg2与n2指向的内存地址没变，n2 == arg2
# 记录：形参与实参即使名字一样，在栈中会存放2份，是不同的栈，指向的堆一样，值则是一样。
def fun(arg1, arg2):
    print('arg1=', arg1, id(arg1))  # arg1指向堆中内存00000011
    print('arg2=', arg2, id(arg2))  # arg2指向堆中内存00000012
    arg1 = 100  # arg1指向堆中内存00000013 ， 100在赋值时会在堆中开辟新内存存放100 ，值变化=堆中的内存发生变化
    arg2.append(10)  # arg2指向堆中内存00000012， 值变化，修改的是堆中内存中的value
    # 如果 此时arg2重新指向内存地址，n2 != arg2 下例：
    # arg2 = [*arg2]
    print('arg1=', arg1, id(arg1))
    print('arg2=', arg2, id(arg2))


n1 = 11  # n1指向堆中内存00000011
n2 = [22, 33, 44]  # n2指向堆中内存00000012
print('n1=', id(n1))
print('n2=', id(n2))
fun(n1, n2)

print('---n1=', id(n1))  # 此时n1指向的还是堆中内存00000011
print('---n2=', id(n2))  # 此时n2指向的还是堆中内存00000012
